ranjithaguna/pv/LED_Demo/source/pic32cx/component/gpio_140_176.h
#define GPIO_140_176_GPIO_175_PIN_CONTROL_PU_PD_Pos (0)                                            /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) These bits are used to enable an internal pull-up or pull-down resistor.\n      00 = None, 01 = Pull Up Enabled, 10 = Pull Down Enabled, 11 = None Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_PU_PD_Msk (0x3U << GPIO_140_176_GPIO_175_PIN_CONTROL_PU_PD_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) These bits are used to enable an internal pull-up or pull-down resistor.\n      00 = None, 01 = Pull Up Enabled, 10 = Pull Down Enabled, 11 = None Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_PU_PD(value) (GPIO_140_176_GPIO_175_PIN_CONTROL_PU_PD_Msk & ((value) << GPIO_140_176_GPIO_175_PIN_CONTROL_PU_PD_Pos))
#define GPIO_140_176_GPIO_175_PIN_CONTROL_POWER_GATING_Pos (2)                                            /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) The GPIO pin will be tristated when the selected power well is off.\n      00 = VTR Power Rail, 01 = VCC Main Power Rail (as determined by the VCC_PWRGD input), 1x = Reserved Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_POWER_GATING_Msk (0x3U << GPIO_140_176_GPIO_175_PIN_CONTROL_POWER_GATING_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) The GPIO pin will be tristated when the selected power well is off.\n      00 = VTR Power Rail, 01 = VCC Main Power Rail (as determined by the VCC_PWRGD input), 1x = Reserved Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_POWER_GATING(value) (GPIO_140_176_GPIO_175_PIN_CONTROL_POWER_GATING_Msk & ((value) << GPIO_140_176_GPIO_175_PIN_CONTROL_POWER_GATING_Pos))
#define GPIO_140_176_GPIO_175_PIN_CONTROL_INTERRUPT_DETECTION_Pos (4)                                            /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) When combined with the field INTERRUPT_DETECTION in this register, determines the interrupt capability of the GPIO input.\n      0 000 = Low Level Sensitive\n      0 001 = High Level Sensitive\n                           0 100 = Interrupt events are disabled\n                           1 101 = Rising Edge Triggered\n                           1 110 = Falling Edge Triggered\n                           1 111 = Either edge triggered Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_INTERRUPT_DETECTION_Msk (0x7U << GPIO_140_176_GPIO_175_PIN_CONTROL_INTERRUPT_DETECTION_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) When combined with the field INTERRUPT_DETECTION in this register, determines the interrupt capability of the GPIO input.\n      0 000 = Low Level Sensitive\n      0 001 = High Level Sensitive\n                           0 100 = Interrupt events are disabled\n                           1 101 = Rising Edge Triggered\n                           1 110 = Falling Edge Triggered\n                           1 111 = Either edge triggered Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_INTERRUPT_DETECTION(value) (GPIO_140_176_GPIO_175_PIN_CONTROL_INTERRUPT_DETECTION_Msk & ((value) << GPIO_140_176_GPIO_175_PIN_CONTROL_INTERRUPT_DETECTION_Pos))
#define GPIO_140_176_GPIO_175_PIN_CONTROL_EDGE_ENABLE_Pos (7)                                            /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) When combined with the field INTERRUPT_DETECTION in this register, determines the interrupt capability of the GPIO input.\n      0 = Edge detection disabled, 1 = Edge detection enabled Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_EDGE_ENABLE_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_EDGE_ENABLE_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) When combined with the field INTERRUPT_DETECTION in this register, determines the interrupt capability of the GPIO input.\n      0 = Edge detection disabled, 1 = Edge detection enabled Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_OUTPUT_BUFFER_TYPE_Pos (8)                                            /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) Unless explicitly stated otherwise, pins with (I/O/OD) or (O/OD) in their buffer type column in the tables are\n      compliant with the following Programmable OD/PP Multiplexing Design Rule: Each compliant pin has a programmable open drain/push-pull\n      buffer controlled by the Output Buffer Type bit in the associated Pin Control Register. The state of this bit controls the mode of\n      the interface buffer for all selected functions, including the GPIO function. 0 = Push-Pull, 1 = Open Drain Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_OUTPUT_BUFFER_TYPE_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_OUTPUT_BUFFER_TYPE_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) Unless explicitly stated otherwise, pins with (I/O/OD) or (O/OD) in their buffer type column in the tables are\n      compliant with the following Programmable OD/PP Multiplexing Design Rule: Each compliant pin has a programmable open drain/push-pull\n      buffer controlled by the Output Buffer Type bit in the associated Pin Control Register. The state of this bit controls the mode of\n      the interface buffer for all selected functions, including the GPIO function. 0 = Push-Pull, 1 = Open Drain Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_DIRECTION_Pos (9)                                            /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) This bit controls the buffer direction only when the MUX_CONTROL field is '00' selecting the pin signal function to\n      be GPIO. When the MUX_CONTROL field is greater than '00' (i.e., a non-GPIO signal function is selected) this bit has no affect\n      and the selected signal function logic directly controls the pin direction. 0 = Input, 1 = Output Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_DIRECTION_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_DIRECTION_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) This bit controls the buffer direction only when the MUX_CONTROL field is '00' selecting the pin signal function to\n      be GPIO. When the MUX_CONTROL field is greater than '00' (i.e., a non-GPIO signal function is selected) this bit has no affect\n      and the selected signal function logic directly controls the pin direction. 0 = Input, 1 = Output Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_OUTPUT_SELECT_Pos (10)                                           /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) This control bit determines which register is used to update the data register for GPIO outputs.\n      0=GPIO output data for this GPIO come from the ALTERNATE_GPIO_DATA field of this register; writes to the bit representing\n      this GPIO in the GPIO Output Register do not affect the GPIO; 1=GPIO output data for this GPIO come from the bit representing\n      this GPIO in the GPIO Output Register; writes to the ALTERNATE_GPIO_DATA field of this register do not affect the GPIO. Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_OUTPUT_SELECT_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_OUTPUT_SELECT_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) This control bit determines which register is used to update the data register for GPIO outputs.\n      0=GPIO output data for this GPIO come from the ALTERNATE_GPIO_DATA field of this register; writes to the bit representing\n      this GPIO in the GPIO Output Register do not affect the GPIO; 1=GPIO output data for this GPIO come from the bit representing\n      this GPIO in the GPIO Output Register; writes to the ALTERNATE_GPIO_DATA field of this register do not affect the GPIO. Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_POLARITY_Pos (11)                                           /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) When the Polarity bit is set to '1' and the MUX_CONTROL bits are greater than '00', the selected signal function outputs\n      are inverted and Interrupt Detection sense is inverted. When the MUX_CONTROL field selects the GPIO signal function (Mux='00'), the\n      Polarity bit does not effect the output. Regardless of the state of the MUX_CONTROL field and the Polarity bit, the state of the pin\n      is always reported without inversion in the GPIO input register. 1=Inverted; 0=Non-inverted Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_POLARITY_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_POLARITY_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) When the Polarity bit is set to '1' and the MUX_CONTROL bits are greater than '00', the selected signal function outputs\n      are inverted and Interrupt Detection sense is inverted. When the MUX_CONTROL field selects the GPIO signal function (Mux='00'), the\n      Polarity bit does not effect the output. Regardless of the state of the MUX_CONTROL field and the Polarity bit, the state of the pin\n      is always reported without inversion in the GPIO input register. 1=Inverted; 0=Non-inverted Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_MUX_CONTROL_Pos (12)                                           /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) This field determines the active signal function for a pin. 00 = GPIO Function Selected, 01 = Signal Function 1 Selected,\n      10 = Signal Function 2 Selected, 11 = Signal Function 3 Selected. Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_MUX_CONTROL_Msk (0x3U << GPIO_140_176_GPIO_175_PIN_CONTROL_MUX_CONTROL_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) This field determines the active signal function for a pin. 00 = GPIO Function Selected, 01 = Signal Function 1 Selected,\n      10 = Signal Function 2 Selected, 11 = Signal Function 3 Selected. Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_MUX_CONTROL(value) (GPIO_140_176_GPIO_175_PIN_CONTROL_MUX_CONTROL_Msk & ((value) << GPIO_140_176_GPIO_175_PIN_CONTROL_MUX_CONTROL_Pos))
#define GPIO_140_176_GPIO_175_PIN_CONTROL_INPUT_DISABLE_Pos (15)                                           /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) GPIO input disable             1=disable input.\n             0=do not disable input bit name.\n Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_INPUT_DISABLE_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_INPUT_DISABLE_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) GPIO input disable             1=disable input.\n             0=do not disable input bit name.\n Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_ALTERNATE_GPIO_DATA_Pos (16)                                           /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) Reads of this bit always return the last data written to the GPIO output data register bit; reads do not return the\n      current output value of the GPIO pin if it is configured as an output. If the GPIO_OUTPUT_SELECT bit in this register is '1', then\n      this bit is Read Only and the GPIO output data register bit is only written by the GPIO Output Register. If the GPIO_OUTPUT_SELECT\n      bit in this register is '0', then this bit is R/W, and the bit corresponding to this GPIO in the GPIO Output Register is Read Only. Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_ALTERNATE_GPIO_DATA_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_ALTERNATE_GPIO_DATA_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) Reads of this bit always return the last data written to the GPIO output data register bit; reads do not return the\n      current output value of the GPIO pin if it is configured as an output. If the GPIO_OUTPUT_SELECT bit in this register is '1', then\n      this bit is Read Only and the GPIO output data register bit is only written by the GPIO Output Register. If the GPIO_OUTPUT_SELECT\n      bit in this register is '0', then this bit is R/W, and the bit corresponding to this GPIO in the GPIO Output Register is Read Only. Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_INPUT_Pos (24)                                           /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) Reads of this bit always return the state of GPIO input from the pad, independent of the Mux selection for the pin\n      or the Direction. This bit is forced high when the selected power well is off as selected by the POWER_GATING field in this register. Position */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_INPUT_Msk (0x1U << GPIO_140_176_GPIO_175_PIN_CONTROL_GPIO_INPUT_Pos)  /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) Reads of this bit always return the state of GPIO input from the pad, independent of the Mux selection for the pin\n      or the Direction. This bit is forced high when the selected power well is off as selected by the POWER_GATING field in this register. Mask */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_Msk (0x0101BFFFUL)                                 /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) Register Mask  */

/** \brief GPIO_140_176 register offsets definitions */
#define GPIO_140_176_GPIO_140_PIN_CONTROL_OFFSET (0x00)         /**< (GPIO_140_176_GPIO_140_PIN_CONTROL) GPIO140 Pin Control Offset */
#define GPIO_140_176_GPIO_141_PIN_CONTROL_OFFSET (0x04)         /**< (GPIO_140_176_GPIO_141_PIN_CONTROL) GPIO 141 Pin Control Offset */
#define GPIO_140_176_GPIO_142_PIN_CONTROL_OFFSET (0x08)         /**< (GPIO_140_176_GPIO_142_PIN_CONTROL) GPIO 142 Pin Control Offset */
#define GPIO_140_176_GPIO_143_PIN_CONTROL_OFFSET (0x0C)         /**< (GPIO_140_176_GPIO_143_PIN_CONTROL) GPIO 143 Pin Control Offset */
#define GPIO_140_176_GPIO_144_PIN_CONTROL_OFFSET (0x10)         /**< (GPIO_140_176_GPIO_144_PIN_CONTROL) GPIO 144 Pin Control Offset */
#define GPIO_140_176_GPIO_145_PIN_CONTROL_OFFSET (0x14)         /**< (GPIO_140_176_GPIO_145_PIN_CONTROL) GPIO 145 Pin Control Offset */
#define GPIO_140_176_GPIO_146_PIN_CONTROL_OFFSET (0x18)         /**< (GPIO_140_176_GPIO_146_PIN_CONTROL) GPIO 146 Pin Control Offset */
#define GPIO_140_176_GPIO_147_PIN_CONTROL_OFFSET (0x1C)         /**< (GPIO_140_176_GPIO_147_PIN_CONTROL) GPIO 147 Pin Control Offset */
#define GPIO_140_176_GPIO_150_PIN_CONTROL_OFFSET (0x20)         /**< (GPIO_140_176_GPIO_150_PIN_CONTROL) GPIO 150 Pin Control Offset */
#define GPIO_140_176_GPIO_151_PIN_CONTROL_OFFSET (0x24)         /**< (GPIO_140_176_GPIO_151_PIN_CONTROL) GPIO 151 Pin Control Offset */
#define GPIO_140_176_GPIO_152_PIN_CONTROL_OFFSET (0x28)         /**< (GPIO_140_176_GPIO_152_PIN_CONTROL) GPIO 152 Pin Control Offset */
#define GPIO_140_176_GPIO_153_PIN_CONTROL_OFFSET (0x2C)         /**< (GPIO_140_176_GPIO_153_PIN_CONTROL) GPIO 153 Pin Control Offset */
#define GPIO_140_176_GPIO_154_PIN_CONTROL_OFFSET (0x30)         /**< (GPIO_140_176_GPIO_154_PIN_CONTROL) GPIO 154 Pin Control Offset */
#define GPIO_140_176_GPIO_155_PIN_CONTROL_OFFSET (0x34)         /**< (GPIO_140_176_GPIO_155_PIN_CONTROL) GPIO 155 Pin Control Offset */
#define GPIO_140_176_GPIO_156_PIN_CONTROL_OFFSET (0x38)         /**< (GPIO_140_176_GPIO_156_PIN_CONTROL) GPIO 156 Pin Control Offset */
#define GPIO_140_176_GPIO_157_PIN_CONTROL_OFFSET (0x3C)         /**< (GPIO_140_176_GPIO_157_PIN_CONTROL) GPIO 157 Pin Control Offset */
#define GPIO_140_176_GPIO_161_PIN_CONTROL_OFFSET (0x44)         /**< (GPIO_140_176_GPIO_161_PIN_CONTROL) GPIO 161 Pin Control Offset */
#define GPIO_140_176_GPIO_162_PIN_CONTROL_OFFSET (0x48)         /**< (GPIO_140_176_GPIO_162_PIN_CONTROL) GPIO 162 Pin Control Offset */
#define GPIO_140_176_GPIO_163_PIN_CONTROL_OFFSET (0x4C)         /**< (GPIO_140_176_GPIO_163_PIN_CONTROL) GPIO 163 Pin Control Offset */
#define GPIO_140_176_GPIO_165_PIN_CONTROL_OFFSET (0x54)         /**< (GPIO_140_176_GPIO_165_PIN_CONTROL) GPIO 165 Pin Control Offset */
#define GPIO_140_176_GPIO_170_PIN_CONTROL_OFFSET (0x60)         /**< (GPIO_140_176_GPIO_170_PIN_CONTROL) GPIO 170 Pin Control Offset */
#define GPIO_140_176_GPIO_171_PIN_CONTROL_OFFSET (0x64)         /**< (GPIO_140_176_GPIO_171_PIN_CONTROL) GPIO 171 Pin Control Offset */
#define GPIO_140_176_GPIO_172_PIN_CONTROL_OFFSET (0x68)         /**< (GPIO_140_176_GPIO_172_PIN_CONTROL) GPIO 172 Pin Control Offset */
#define GPIO_140_176_GPIO_175_PIN_CONTROL_OFFSET (0x74)         /**< (GPIO_140_176_GPIO_175_PIN_CONTROL) GPIO 175 Pin Control Offset */

/** \brief GPIO_140_176 register API structure */
typedef struct
{  /* GPIO 140:176 Pin Control Registers */
  __IO  __GPIO_140_176_GPIO_140_PIN_CONTROL_bits_t GPIO_140_PIN_CONTROL; /**< Offset: 0x00 (R/W  32) GPIO140 Pin Control */
  __IO  __GPIO_140_176_GPIO_141_PIN_CONTROL_bits_t GPIO_141_PIN_CONTROL; /**< Offset: 0x04 (R/W  32) GPIO 141 Pin Control */
  __IO  __GPIO_140_176_GPIO_142_PIN_CONTROL_bits_t GPIO_142_PIN_CONTROL; /**< Offset: 0x08 (R/W  32) GPIO 142 Pin Control */
  __IO  __GPIO_140_176_GPIO_143_PIN_CONTROL_bits_t GPIO_143_PIN_CONTROL; /**< Offset: 0x0C (R/W  32) GPIO 143 Pin Control */
  __IO  __GPIO_140_176_GPIO_144_PIN_CONTROL_bits_t GPIO_144_PIN_CONTROL; /**< Offset: 0x10 (R/W  32) GPIO 144 Pin Control */
  __IO  __GPIO_140_176_GPIO_145_PIN_CONTROL_bits_t GPIO_145_PIN_CONTROL; /**< Offset: 0x14 (R/W  32) GPIO 145 Pin Control */
  __IO  __GPIO_140_176_GPIO_146_PIN_CONTROL_bits_t GPIO_146_PIN_CONTROL; /**< Offset: 0x18 (R/W  32) GPIO 146 Pin Control */
  __IO  __GPIO_140_176_GPIO_147_PIN_CONTROL_bits_t GPIO_147_PIN_CONTROL; /**< Offset: 0x1C (R/W  32) GPIO 147 Pin Control */
  __IO  __GPIO_140_176_GPIO_150_PIN_CONTROL_bits_t GPIO_150_PIN_CONTROL; /**< Offset: 0x20 (R/W  32) GPIO 150 Pin Control */
  __IO  __GPIO_140_176_GPIO_151_PIN_CONTROL_bits_t GPIO_151_PIN_CONTROL; /**< Offset: 0x24 (R/W  32) GPIO 151 Pin Control */
  __IO  __GPIO_140_176_GPIO_152_PIN_CONTROL_bits_t GPIO_152_PIN_CONTROL; /**< Offset: 0x28 (R/W  32) GPIO 152 Pin Control */
  __IO  __GPIO_140_176_GPIO_153_PIN_CONTROL_bits_t GPIO_153_PIN_CONTROL; /**< Offset: 0x2C (R/W  32) GPIO 153 Pin Control */
  __IO  __GPIO_140_176_GPIO_154_PIN_CONTROL_bits_t GPIO_154_PIN_CONTROL; /**< Offset: 0x30 (R/W  32) GPIO 154 Pin Control */
  __IO  __GPIO_140_176_GPIO_155_PIN_CONTROL_bits_t GPIO_155_PIN_CONTROL; /**< Offset: 0x34 (R/W  32) GPIO 155 Pin Control */
  __IO  __GPIO_140_176_GPIO_156_PIN_CONTROL_bits_t GPIO_156_PIN_CONTROL; /**< Offset: 0x38 (R/W  32) GPIO 156 Pin Control */
  __IO  __GPIO_140_176_GPIO_157_PIN_CONTROL_bits_t GPIO_157_PIN_CONTROL; /**< Offset: 0x3C (R/W  32) GPIO 157 Pin Control */
  __IO  __GPIO_140_176_GPIO_161_PIN_CONTROL_bits_t GPIO_161_PIN_CONTROL; /**< Offset: 0x44 (R/W  32) GPIO 161 Pin Control */
  __IO  __GPIO_140_176_GPIO_162_PIN_CONTROL_bits_t GPIO_162_PIN_CONTROL; /**< Offset: 0x48 (R/W  32) GPIO 162 Pin Control */
  __IO  __GPIO_140_176_GPIO_163_PIN_CONTROL_bits_t GPIO_163_PIN_CONTROL; /**< Offset: 0x4C (R/W  32) GPIO 163 Pin Control */
  __IO  __GPIO_140_176_GPIO_165_PIN_CONTROL_bits_t GPIO_165_PIN_CONTROL; /**< Offset: 0x54 (R/W  32) GPIO 165 Pin Control */
  __IO  __GPIO_140_176_GPIO_170_PIN_CONTROL_bits_t GPIO_170_PIN_CONTROL; /**< Offset: 0x60 (R/W  32) GPIO 170 Pin Control */
  __IO  __GPIO_140_176_GPIO_171_PIN_CONTROL_bits_t GPIO_171_PIN_CONTROL; /**< Offset: 0x64 (R/W  32) GPIO 171 Pin Control */
  __IO  __GPIO_140_176_GPIO_172_PIN_CONTROL_bits_t GPIO_172_PIN_CONTROL; /**< Offset: 0x68 (R/W  32) GPIO 172 Pin Control */
  __IO  __GPIO_140_176_GPIO_175_PIN_CONTROL_bits_t GPIO_175_PIN_CONTROL; /**< Offset: 0x74 (R/W  32) GPIO 175 Pin Control */
} gpio140176_registers_t;
/** @}  end of GPIO 140:176 Pin Control Registers */

#endif /* _PIC32CX_0525SG12_GPIO_140_176_COMPONENT_H_ */
